[{"tag": "Sequential Art", "title": "Art Ops Vol. 1", "price": "£48.80", "rating": "Three", "image_urls": ["http://books.toscrape.com/media/cache/36/36/3636bc73e33a70300d8265667373d622.jpg"], "product_desc": "Reggie Riot is no one’s idea of a cultural savior. The latchkey child of a busy single mother, he’s grown up to be a resentful slacker whose idea of high culture is getting stoned and admiring the graffiti in the alley where he scores his weed. His mother, however, is not your average working parent. She’s the head of a secret organization called Art Ops, whose mission i Reggie Riot is no one’s idea of a cultural savior. The latchkey child of a busy single mother, he’s grown up to be a resentful slacker whose idea of high culture is getting stoned and admiring the graffiti in the alley where he scores his weed.   His mother, however, is not your average working parent. She’s the head of a secret organization called Art Ops, whose mission is protecting the artistic treasures of the world—which have a lot more life in them than a casual observer might realize.   Reggie has always shunned his mom’s high-culture scene, but a devastating encounter with the shadowy forces menacing the world’s masterpieces has left him with a permanent expression of the chaotic power of art flowing through his very veins.   So when Art Ops itself suddenly vanishes without a trace, leaving its final rescue—La Gioconda, the Mona Lisa herself—out in the cold, it’s up to Reggie and his motley crew—including a masked super-powered operative who writes sitcom scripts on spec, a girls-just-wanna-have-fun ’80s music-video icon, and a suburban clerk from a mall-punk clothing chain—to come to the rescue.   But do they have what it takes to stand up to the dark side of human creativity?   From writer Shaun Simon (co-author of The True Lives of the Fabulous Killjoys with My Chemical Romance’s Gerard Way) and artists Michael Allred (co-creator of iZOMBIE) and Matt Brundage (The Spirit: The New Adventures) comes ART OPS VOL. 1: HOW TO START A RIOT, collecting issues #1-5 of the ongoing VERTIGO series and featuring a special sketchbook section from Allred and Brundage. ...more"}]