[{"tag": "Childrens", "title": "The Day the Crayons Came Home (Crayons)", "price": "£26.33", "rating": "Five", "image_urls": ["http://books.toscrape.com/media/cache/34/b2/34b2631bafd148bcd8dcd850a4b75971.jpg"], "product_desc": "The companion to the #1 blockbuster bestseller, The Day the Crayons Quit! I'm not sure what it is about this kid Duncan, but his crayons sure are a colorful bunch of characters! Having soothed the hurt feelings of one group who threatened to quit, Duncan now faces a whole new group of crayons asking to be rescued. From Maroon Crayon, who was lost beneath the sofa cushions The companion to the #1 blockbuster bestseller, The Day the Crayons Quit! I'm not sure what it is about this kid Duncan, but his crayons sure are a colorful bunch of characters! Having soothed the hurt feelings of one group who threatened to quit, Duncan now faces a whole new group of crayons asking to be rescued. From Maroon Crayon, who was lost beneath the sofa cushions and then broken in two after Dad sat on him; to poor Turquoise, whose head is now stuck to one of Duncan's stinky socks after they both ended up in the dryer together; to Pea Green, who knows darn well that no kid likes peas and who ran away—each and every crayon has a woeful tale to tell and a plea to be brought home to the crayon box. Drew Daywalt and Oliver Jeffers have combined to create a companion book every bit as funny and kid-friendly as the #1 bestselling The Day the Crayons Quit.Praise for The Day the Crayons Quit The #1 New York Times bestselling phenomenon — over 80 weeks on the bestseller list!Winner of the E.B. White Read-Aloud Award Amazon’s 2013 Best Picture Book of the Year A Barnes & Noble Best Book of 2013 Goodreads’ 2013 Best Picture Book of the Year  * “Hilarious . . . Move over, Click, Clack, Moo; we’ve got a new contender for the most successful picture-book strike.” –BCCB, starred review  “Jeffers . . . elevates crayon drawing to remarkable heights.” –Booklist “Fresh and funny.” –The Wall Street Journal \"This book will have children asking to have it read again and again.” –Library Media Connection * “This colorful title should make for an uproarious storytime.” –School Library Journal, starred review  * “These memorable personalities will leave readers glancing apprehensively at their own crayon boxes.” –Publishers Weekly, starred review  “Utterly original.” –San Francisco Chronicle ...more"}]