[{"tag": "Young Adult", "title": "The Haters", "price": "£27.89", "rating": "Five", "image_urls": ["http://books.toscrape.com/media/cache/4a/13/4a1370ebafcaf6ba5f5e1fe4a609b6d8.jpg"], "product_desc": "From Jesse Andrews, author of the New York Times bestselling Me and Earl and the Dying Girl and screenwriter of the Sundance award–winning motion picture of the same name, comes a groundbreaking young adult novel about music, love, friendship, and freedom as three young musicians follow a quest to escape the law long enough to play the amazing show they hope (but also doub From Jesse Andrews, author of the New York Times bestselling Me and Earl and the Dying Girl and screenwriter of the Sundance award–winning motion picture of the same name, comes a groundbreaking young adult novel about music, love, friendship, and freedom as three young musicians follow a quest to escape the law long enough to play the amazing show they hope (but also doubt) they have in them.Inspired by the years he spent playing bass in a band himself, The Haters is Jesse Andrews’s road trip adventure about a trio of jazz-camp escapees who, against every realistic expectation, become a band. For Wes and his best friend, Corey, jazz camp turns out to be lame. It’s pretty much all dudes talking in Jazz Voice. But then they jam with Ash, a charismatic girl with an unusual sound, and the three just click. It’s three and a half hours of pure musical magic, and Ash makes a decision: They need to hit the road. Because the road, not summer camp, is where bands get good. Before Wes and Corey know it, they’re in Ash’s SUV heading south, and The Haters Summer of Hate Tour has begun.In his second novel, Andrews again brings his brilliant and distinctive voice to YA, in the perfect book for music lovers, fans of The Commitments and High Fidelity, or anyone who has ever loved—and hated—a song or a band. This witty, funny coming-of-age novel is contemporary fiction at its best. ...more"}]