[{"tag": "Nonfiction", "title": "Abstract City", "price": "£56.37", "rating": "Five", "image_urls": ["http://books.toscrape.com/media/cache/5f/5e/5f5e2741d6c84f05fdd5adf8ba0d5642.jpg"], "product_desc": "In July 2008, illustrator and designer Christoph Niemann began Abstract City, a visual blog for the New York Times. His posts were inspired by the desire to re-create simple and everyday observations and stories from his own life that everyone could relate to. In Niemann’s hands, mundane experiences such as riding the subway or trying to get a good night’s sleep were trans In July 2008, illustrator and designer Christoph Niemann began Abstract City, a visual blog for the New York Times. His posts were inspired by the desire to re-create simple and everyday observations and stories from his own life that everyone could relate to. In Niemann’s hands, mundane experiences such as riding the subway or trying to get a good night’s sleep were transformed into delightful flights of visual fancy. The struggle to keep up with housework became a battle against adorable but crafty goblins, and nostalgia about New York manifested in simple but strikingly spot-on LEGO creations. This brilliantly illustrated collection of reflections on modern life includes all 16 of the original blog posts as well as a new chapter created exclusively for the book. Also available from Christoph Niemann: Sunday Sketching and I LEGO N.Y. Praise for Abstract City: “Everyday experiences—from looking at leaves to riding city subways—are funny and fresh and often a source of wonder when depicted by this brilliant graphic designer.” —Readers Digest “I will call Christoph when anything awful happens to me. And he will make me laugh like crazy about the whole thing. Because he is insanely funny and completely tenderly true. I love every column he did and will do.” —Maira Kalman, author/illustrator of And the Pursuit of Happiness “Christoph Niemann is the best illustrator alive. Every single time I come across a piece of his work, which is often as he either works all the time, or worse, draws incredibly fast, it is wonderful. While the rest of us are lucky to get a proper piece out here and there, Christoph produces hit after hit after hit. If he wasn’t such a genuinely sweet man, we’d surely hate his ass a lot.” —Stefan Sagmeister, author of Things I Have Learned in My Life So Far “Few books have more probingly and humorously gotten inside the mind and day-to-day experience of an artist.” —NPR.org \"What’s terrifying (to me, certainly, and possibly to many of his peers) is that nearly every idea he has seems to be equally well formed . . . once again, performing neat, virtuosic circles around the rest of us, to our delight.\" —PRINT magazine \"Irresistible.\" —Very Short List “A masterpiece of sophisticated humor, this is a brilliant one-of-a-kind work.” —Library Journal, starred review ...more"}]