[{"tag": "Fantasy", "title": "The Silent Twin (Detective Jennifer Knight #3)", "price": "£36.25", "rating": "Three", "image_urls": ["http://books.toscrape.com/media/cache/c1/80/c1800f5a0eaaaea8c2283b129cbac4ae.jpg"], "product_desc": "I’m alone in the dark, please can you find me …Nine-year-old twins Abigail and Olivia vow never to be parted. But when Abigail goes missing from Blackwater Farm, DC Jennifer Knight must find her before it’s too late. Twin sister Olivia has been mute since Abigail’s disappearance. But when she whispers in Jennifer’s ear, Jennifer realises it is Abigail’s voice pleading to b I’m alone in the dark, please can you find me …Nine-year-old twins Abigail and Olivia vow never to be parted. But when Abigail goes missing from Blackwater Farm, DC Jennifer Knight must find her before it’s too late. Twin sister Olivia has been mute since Abigail’s disappearance. But when she whispers in Jennifer’s ear, Jennifer realises it is Abigail’s voice pleading to be found. A damp and decaying house set in acres of desolate scrubland, the farm is a place of secrets, old and new – and Jennifer must unravel them all in order to find the lost girl. But could Olivia’s bond with her twin hold the key to finding Abigail? And can Jennifer break through her silence in time to save her sister’s life? A darkly gripping, page-turning thriller that will enthrall fans of Rachel Abbott, Alex Marwood’s The Wicked Girls and Mark Edwards. Praise for Caroline Mitchell:‘Fan-bloody-tastic! I enjoyed this book so much that I forced myself to read slowly as I just could not bear for it to end… I thought the story was brilliant. The characters were creative and kept me hooked. ‘The twists and turns kept me gasping for more… Could not recommend this book any more highly!’ Crime Book Junkie ‘This is a well written supernatural detective story, with a surprising twist that I guarantee will keep you glued to the last page… at times I couldn’t turn the pages quickly enough, it’s atmospheric, gritty and at times just plain scary, and what a twist at the end.’ The Book Review Café ‘With a brilliant cast of crime characters, and a plot that was enough to make me feel dizzy, this was a compelling book that I just couldn't get enough of. Every word, every page, every murder, every guess... I couldn't wait for the final piece of the jigsaw to fit into place… the word 'thrilling' just doesn't do this justice.’ Becca’s Books ...more"}]