[{"tag": "Autobiography", "title": "Life Without a Recipe", "price": "£59.04", "rating": "Five", "image_urls": ["http://books.toscrape.com/media/cache/9e/4f/9e4fb935df3113056cc9bdee6cd09ea6.jpg"], "product_desc": "On one side, there is Grace: prize-winning author Diana Abu-Jaber’s tough, independent sugar-fiend of a German grandmother, wielding a suitcase full of holiday cookies. On the other, Bud: a flamboyant, spice-obsessed Arab father, full of passionate argument. The two could not agree on anything: not about food, work, or especially about what Diana should do with her life. G On one side, there is Grace: prize-winning author Diana Abu-Jaber’s tough, independent sugar-fiend of a German grandmother, wielding a suitcase full of holiday cookies. On the other, Bud: a flamboyant, spice-obsessed Arab father, full of passionate argument. The two could not agree on anything: not about food, work, or especially about what Diana should do with her life. Grace warned her away from children. Bud wanted her married above all—even if he had to provide the ring. Caught between cultures and lavished with contradictory “advice” from both sides of her family, Diana spent years learning how to ignore others’ well-intentioned prescriptions.Hilarious, gorgeously written, poignant, and wise, Life Without a Recipe is Diana’s celebration of journeying without a map, of learning to ignore the script and improvise, of escaping family and making family on one’s own terms. As Diana discovers, however, building confidence in one’s own path sometimes takes a mistaken marriage or two—or in her case, three: to a longhaired boy-poet, to a dashing deconstructionist literary scholar, and finally to her steadfast, outdoors-loving Scott. It also takes a good deal of angst (was it possible to have a serious writing career and be a mother?) and, even when she knew what she wanted (the craziest thing, in one’s late forties: a baby!), the nerve to pursue it.Finally, fearlessly independent like the Grace she’s named after, Diana and Scott’s daughter Gracie will heal all the old battles with Bud and, like her writer-mom, learn to cook up a life without a recipe. ...more"}]