[{"tag": "Science Fiction", "title": "Sleeping Giants (Themis Files #1)", "price": "£48.74", "rating": "One", "image_urls": ["http://books.toscrape.com/media/cache/ac/a5/aca5de2e61ca2754de496a75dea25f91.jpg"], "product_desc": "A page-turning debut in the tradition of Michael Crichton, World War Z, and The Martian, Sleeping Giants is a thriller fueled by an earthshaking mystery—and a fight to control a gargantuan power.A girl named Rose is riding her new bike near her home in Deadwood, South Dakota, when she falls through the earth. She wakes up at the bottom of a square hole, its walls glowing w A page-turning debut in the tradition of Michael Crichton, World War Z, and The Martian, Sleeping Giants is a thriller fueled by an earthshaking mystery—and a fight to control a gargantuan power.A girl named Rose is riding her new bike near her home in Deadwood, South Dakota, when she falls through the earth. She wakes up at the bottom of a square hole, its walls glowing with intricate carvings. But the firemen who come to save her peer down upon something even stranger: a little girl in the palm of a giant metal hand.Seventeen years later, the mystery of the bizarre artifact remains unsolved—its origins, architects, and purpose unknown. Its carbon dating defies belief; military reports are redacted; theories are floated, then rejected.But some can never stop searching for answers.Rose Franklin is now a highly trained physicist leading a top secret team to crack the hand’s code. And along with her colleagues, she is being interviewed by a nameless interrogator whose power and purview are as enigmatic as the provenance of the relic. What’s clear is that Rose and her compatriots are on the edge of unraveling history’s most perplexing discovery—and figuring out what it portends for humanity. But once the pieces of the puzzle are in place, will the result prove to be an instrument of lasting peace or a weapon of mass destruction? ...more"}]