[{"tag": "Horror", "title": "Security", "price": "£39.25", "rating": "Two", "image_urls": ["http://books.toscrape.com/media/cache/79/2b/792bdeb2cf7d8efaef0e401e5a27b4da.jpg"], "product_desc": "“Original and imaginative . . . Ripping suspense, sheer terror, and a wrenching love story.” —Sandra Brown, New York Times bestselling author of FrictionThe terrible truth about Manderley is that someone is always watching. Manderley Resort is a gleaming, new twenty-story hotel on the California coast. It’s about to open its doors, and the world--at least those with the me “Original and imaginative . . . Ripping suspense, sheer terror, and a wrenching love story.” —Sandra Brown, New York Times bestselling author of FrictionThe terrible truth about Manderley is that someone is always watching. Manderley Resort is a gleaming, new twenty-story hotel on the California coast. It’s about to open its doors, and the world--at least those with the means to afford it--will be welcomed into a palace of opulence and unparalleled security. But someone is determined that Manderley will never open. The staff has no idea that their every move is being watched, and over the next twelve hours they will be killed off, one by one. Writing in the tradition of Edgar Allan Poe and Stephen King, and with a deep bow to Daphne du Maurier, author Gina Wohlsdorf pairs narrative ingenuity and razor-wire prose with quick twists, sharp turns, and gasp-inducing terror. Security is grand guignol storytelling at its very best. A shocking thriller, a brilliant narrative puzzle, and a multifaceted love story unlike any other, Security marks the debut of a fearless and gifted writer. “Be surprised, be very surprised: Gina Wohlsdorf brings more than just plot twists and a terrifically tender love story to this thriller . . . It’s her playful homage to Hitchcock and du Maurier that had me reading, howling, and just plain loving this novel.” —Sara Gruen, author of At the Water’s Edge “Grand Hotel meets Psycho in the age of surveillance . . . Security is cinematically vivid, crisply written, and sharp enough to cut . . . Wohlsdorf brilliantly subverts our expectations of the action genre in this smart, shocking, poignant thriller.” —Emily Croy Barker, author of The Thinking Woman’s Guide to Real Magic “The thrill of this novel goes beyond its wickedly clever,  split-screen, high-tech wizardry—a kind of video gamer’s literary retake of Hitchcock’s Rear Window--and emanates  from its strange, disembodied narrator . . . The effect is terrifying, sexy, dizzying, and impossible to look away from.” —Tim Johnston, author of Descent “Shocking and filled with Tarantino-ish dark humor. . . Structurally reminiscent of the amazing Jennifer Egan,Wohlsdorf’s book is certainly a hybrid, like nothing else. Get ready.” —Ann Beattie, author of The State We’re In “Flawless . . . Security is perfectly tuned for blockbuster status . . . They don’t make a hotel big enough to house all the people who will want to read this, and soon, as in Manderley, all eyes will be on Wohlsdorf.” —Daniel Kraus, Booklist, starred review   ...more"}]