[{"tag": "Mystery", "title": "The Girl In The Ice (DCI Erika Foster #1)", "price": "£15.85", "rating": "Three", "image_urls": ["http://books.toscrape.com/media/cache/83/54/835421d17d99c89fd99d07e17806357b.jpg"], "product_desc": "Her eyes are wide open. Her lips parted as if to speak. Her dead body frozen in the ice…She is not the only one. When a young boy discovers the body of a woman beneath a thick sheet of ice in a South London park, Detective Erika Foster is called in to lead the murder investigation. The victim, a beautiful young socialite, appeared to have the perfect life. Yet when Erika b Her eyes are wide open. Her lips parted as if to speak. Her dead body frozen in the ice…She is not the only one. When a young boy discovers the body of a woman beneath a thick sheet of ice in a South London park, Detective Erika Foster is called in to lead the murder investigation. The victim, a beautiful young socialite, appeared to have the perfect life. Yet when Erika begins to dig deeper, she starts to connect the dots between the murder and the killings of three prostitutes, all found strangled, hands bound and dumped in water around London. What dark secrets is the girl in the ice hiding? As Erika inches closer to uncovering the truth, the killer is closing in on Erika. The last investigation Erika led went badly wrong… resulting in the death of her husband. With her career hanging by a thread, Erika must now battle her own personal demons as well as a killer more deadly than any she’s faced before. But will she get to him before he strikes again?A page-turning thriller packed with suspense. If you like Angela Marsons, Rachel Abbott and Karin Slaughter, discover Rob Bryndza’s new series today – at a special launch price. Watch out for more from DCI Erika FosterShe’s fearless. Respected. Unstoppable. Detective Erika Foster will catch a killer, whatever it takes. 1. THE GIRL IN THE ICE 2. THE NIGHT STALKER (COMING SOON) ...more"}]