[{"tag": "Fiction", "title": "Daredevils", "price": "£16.34", "rating": "Three", "image_urls": ["http://books.toscrape.com/media/cache/79/47/79478ba5ab673fbdfe79a745a14fb9de.jpg"], "product_desc": "From the winner of 2014’s PEN Robert W. Bingham Prize, an unforgettable debut novel about Loretta, a teenager married off as a “sister wife,” who makes a break for freedomAt the heart of this exciting debut novel, set in Arizona and Idaho in the mid-1970s, is fifteen-year-old Loretta, who slips out of her bedroom every evening to meet her so-called gentile boyfriend. Her s From the winner of 2014’s PEN Robert W. Bingham Prize, an unforgettable debut novel about Loretta, a teenager married off as a “sister wife,” who makes a break for freedom At the heart of this exciting debut novel, set in Arizona and Idaho in the mid-1970s, is fifteen-year-old Loretta, who slips out of her bedroom every evening to meet her so-called gentile boyfriend. Her strict Mormon parents catch her returning one night, and promptly marry her off to Dean Harder, a devout yet materialistic fundamentalist who already has a wife and a brood of kids. The Harders relocate to his native Idaho, where Dean’s teenage nephew Jason falls hard for Loretta. A Zeppelin and Tolkien fan, Jason worships Evel Knievel and longs to leave his close-minded community. He and Loretta make a break for it. They drive all night, stay in hotels, and relish their dizzying burst of teenage freedom as they seek to recover Dean’s cache of “Mormon gold.” But someone Loretta left behind is on their trail... A riveting story of desire and escape, Daredevils boasts memorable set pieces and a rich cast of secondary characters. There’s Dean’s other wife, Ruth, who as a child in the 1950s was separated from her parents during the notorious Short Creek raid, when federal agents descended on a Mormon fundamentalist community. There’s Jason’s best friend, Boyd, part Native American and caught up in the activist spirit of the time, who comes along for the ride, with disastrous results. And Vestal’s ultimate creation is a superbly sleazy chatterbox—a man who might or might not be Evel Knievel himself—who works his charms on Loretta at a casino in Elko, Nevada.A lifelong journalist whose Spokesman column is a fixture in Spokane, WA, Shawn has honed his fiction over many years, publishing in journals like McSweeney's and Tin House. His stunning first collection, Godforsaken Idaho, burrowed into history as it engaged with masculinity and crime, faith and apostasy, and the West that he knows so well. Daredevils shows what he can do on a broader canvas--a fascinating, wide-angle portrait of a time and place that's both a classic coming of age tale and a plunge into the myths of America, sacred and profane. ...more"}]