[{"tag": "Fiction", "title": "The Expatriates", "price": "£44.58", "rating": "Two", "image_urls": ["http://books.toscrape.com/media/cache/4a/96/4a96cd8c43ea6c74d5b8d9ce1d47c187.jpg"], "product_desc": "“A female, funny Henry James in Asia, Janice Y. K. Lee is vividly good on the subject of Americans abroad.” —The New York Times Book Review“Sex and the City meets Lost in Translation.” —The SkimmJanice Y. K. Lee’s New York Times bestselling debut, The Piano Teacher, was called “immensely satisfying” by People, “intensely readable” by O, The Oprah Magazine, and “a rare and “A female, funny Henry James in Asia, Janice Y. K. Lee is vividly good on the subject of Americans abroad.” —The New York Times Book Review“Sex and the City meets Lost in Translation.” —The SkimmJanice Y. K. Lee’s New York Times bestselling debut, The Piano Teacher, was called “immensely satisfying” by People, “intensely readable” by O, The Oprah Magazine, and “a rare and exquisite story” by Elizabeth Gilbert. Now, in her long-awaited new novel, Lee explores with devastating poignancy the emotions, identities, and relationships of three very different American women living in the same small expat community in Hong Kong.Mercy, a young Korean American and recent Columbia graduate, is adrift, undone by a terrible incident in her recent past. Hilary, a wealthy housewife, is haunted by her struggle to have a child, something she believes could save her foundering marriage. Meanwhile, Margaret, once a happily married mother of three, questions her maternal identity in the wake of a shattering loss. As each woman struggles with her own demons, their lives collide in ways that have irreversible consequences for them all. Atmospheric, moving, and utterly compelling, The Expatriates confirms Lee as an exceptional talent and one of our keenest observers of women’s inner lives. ...more"}]