[{"tag": "Food and Drink", "title": "Barefoot Contessa Back to Basics", "price": "£28.01", "rating": "One", "image_urls": ["http://books.toscrape.com/media/cache/29/b1/29b1f537504f37527f1bf8182559684e.jpg"], "product_desc": "#1 NEW YORK TIMES BESTSELLERBarefoot Contessa Back to Basics is the essential Ina Garten cookbook, focusing on the techniques behind her elegant food and easy entertaining style, and offering nearly a hundred brand-new recipes that will become trusted favorites. Ina Garten’ s bestselling cookbooks have con-sistently provided accessible, subtly sophisticated recipes ranging #1 NEW YORK TIMES BESTSELLERBarefoot Contessa Back to Basics is the essential Ina Garten cookbook, focusing on the techniques behind her elegant food and easy entertaining style, and offering nearly a hundred brand-new recipes that will become trusted favorites. Ina Garten’ s bestselling cookbooks have con-sistently provided accessible, subtly sophisticated recipes ranging from French classics made easy to delicious, simple home cooking. In Barefoot Contessa Back to Basics, Ina truly breaks down her ideas on flavor, examining the ingredients and techniques that are the foundation of her easy, refined style. Here Ina covers the essentials, from ten ways to boost the flavors of your ingredients to ten things not to serve at a party, as well as professional tips that make successful baking, cooking, and entertaining a breeze. The recipes—crowd-pleasers like Lobster Corn Chowder, Tuscan Lemon Chicken, and Easy Sticky Buns—demonstrate Ina’s talent for transforming fresh, easy-to-find ingredients into elegant meals you can make without stress. For longtime fans, Ina delivers new insights into her simple techniques; for newcomers she provides a thorough master class on the basics of Barefoot Contessa cooking plus a Q&A section with answers to the questions people ask her all the time. With full-color photographs and invaluable cooking tips, Barefoot Contessa Back to Basics is an essential addition to the cherished library of Barefoot Contessa cookbooks. ...more"}]