[{"tag": "Christian Fiction", "title": "Close to You", "price": "£49.46", "rating": "Four", "image_urls": ["http://books.toscrape.com/media/cache/94/f4/94f4405dae04559ecdd92e62486623e3.jpg"], "product_desc": "A disgraced scholar running from her past and an entrepreneur chasing his future find themselves thrown together—and fall in love—on a Tolkien tour of New Zealand.Allison Shire (yes, like where the Hobbits live) is a disgraced academic who is done with love. Her belief in “happily ever after” ended the day she discovered her husband was still married to a wife she knew not A disgraced scholar running from her past and an entrepreneur chasing his future find themselves thrown together—and fall in love—on a Tolkien tour of New Zealand.Allison Shire (yes, like where the Hobbits live) is a disgraced academic who is done with love. Her belief in “happily ever after” ended the day she discovered her husband was still married to a wife she knew nothing about. She finally finds a use for her English degree by guiding tours through the famous sites featured in the Lord of the Rings and The Hobbit movies. By living life on the road and traveling New Zealand as a luxury tour guide, Allison manages to outrun the pain of her past she can’t face.Jackson Gregory was on the cusp of making it big. Then suddenly his girlfriend left him—for his biggest business competitor—and took his most guarded commercial secrets with her. To make matters worse, the Iowa farm that has been in his family for generations is facing foreclosure. Determined to save his parents from financial ruin, he’ll do whatever it takes to convince his wealthy great-uncle to invest in his next scheme, which means accompanying him to the bottom of the world to spend three weeks pretending to be a die-hard Lord of the Rings fan, even though he knows nothing about the stories. The one thing that stands between him and his goal is a know-it-all tour guide who can’t stand him and pegged him as a fake the moment he walked off the plane.When Allison leads the group through the famous sites of the Tolkien movies, she and Jackson start to see each other differently, and as they keep getting thrown together on the tour, they find themselves drawn to each other. Neither expected to fall in love again, but can they find a way beyond their regrets to take a chance on the one thing they’re not looking for? ...more"}]