[{"tag": "Romance", "title": "A Girl's Guide to Moving On (New Beginnings #2)", "price": "£31.30", "rating": "One", "image_urls": ["http://books.toscrape.com/media/cache/17/94/17940ad8d367ea5f28db57e7fc32dac9.jpg"], "product_desc": "NEW YORK TIMES BESTSELLER • In this powerful and uplifting novel, a mother and her daughter-in-law bravely leave their troubled marriages and face the challenge of starting over. Leaning on each other, Nichole and Leanne discover that their inner strength and capacity for love are greater than they ever imagined. When Nichole discovers that her husband, Jake, has been unfa NEW YORK TIMES BESTSELLER • In this powerful and uplifting novel, a mother and her daughter-in-law bravely leave their troubled marriages and face the challenge of starting over. Leaning on each other, Nichole and Leanne discover that their inner strength and capacity for love are greater than they ever imagined. When Nichole discovers that her husband, Jake, has been unfaithful, the illusion of her perfect life is indelibly shattered. While juggling her young son, a new job, and volunteer work, Nichole meets Rocco, who is the opposite of Jake in nearly every way. Though blunt-spoken and rough around the edges, Rocco proves to be a dedicated father and thoughtful friend. But just as their relationship begins to blossom, Jake wagers everything on winning Nichole back—including their son Owen’s happiness. Somehow, Nichole must find the courage to defy her fears and follow her heart, with far-reaching consequences for them all. Leanne has quietly ignored her husband’s cheating for decades, but is jolted into action by the echo of Nichole’s all-too-familiar crisis. While volunteering as a teacher of English as a second language, Leanne meets Nikolai, a charming, talented baker from Ukraine. Resolved to avoid the heartache and complications of romantic entanglements, Leanne nonetheless finds it difficult to resist Nikolai’s effusive overtures—until an unexpected tragedy tests the very fabric of her commitments. An inspiring novel of friendship, reinvention, and hope, A Girl’s Guide to Moving On affirms the ability of every woman to forge a new path, believe in love, and fearlessly find happiness.Praise for A Girl’s Guide to Moving On “Debbie Macomber’s finest novel. Betrayal and sorrow can happen in any stage of life and, in this wonderful story, her very nimble hands weave a spectacular kaleidoscope of courage, struggles, and finally joyous redemption and reinvention. Macomber totally understands the human heart. I absolutely loved it!”—Dorothea Benton Frank, New York Times bestselling author of All the Single Ladies “Whispers a message of love, hope, and, yes, reinvention to every woman who has ever wondered ‘Is that all there is?’ I predict every diehard Macomber fan—as well as legions of readers new to the Macomber magic—will be cheering for Leanne and Nichole, and clamoring for more, more, more.”—Mary Kay Andrews, New York Times bestselling author of Beach Town, Ladies’ Night, and Summer Rental “Macomber is a master at pulling heartstrings, and readers will delight in this heartwarming story of friendship, love, and second chances. Leanne, Nichole, Rocco, and Nikolai will renew your faith in love and hope. The perfect read curled up in front of the fire or on a beach, it’s as satisfying as a slice of freshly baked bread—wholesome, pleasantly filling, and delicious.”—Karen White, New York Times bestselling author of Flight Patterns “Beloved author Debbie Macomber reaches new heights in this wise and beautiful novel. It’s the kind of reading experience that comes along only rarely, bearing the hallmarks of a classic. The timeless wisdom in these pages will stay with you long after the book is closed.”—Susan Wiggs, #1 New York Times bestselling author of Starlight on Willow Lake “Debbie dazzles! A wonderful story of friendship, forgiveness and the power of love. I devoured every page!”—Susan Mallery, #1 New York Times bestselling author of The Friends We Keep ...more"}]